05_DTCHull_Numerics_Initialization_setFields/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut; // turbulence viscosity of the boundary condition
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Turbulence viscosity can be used to correct the viscosity to get the proper wall shear stress when using turbulence model to do the CFD simulations.

dimensions      [0 2 -1 0 0 0 0]; // [m^2/s]

internalField   uniform 5e-07;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
    }

    atmosphere
    {
        type            zeroGradient;
    }

    hull
    {
        type            nutkRoughWallFunction; // nutWallFunction (provides Dirichlet boundary condition) >> nutkWallFunction >> nutkRoughWallFunction
        Ks              uniform 100e-6;
        Cs              uniform 0.5;
        value           $internalField;
    }
}


// ************************************************************************* //
