05_DTCHull_Numerics_Initialization_setFields/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// properties of water and air
// these values will also be used when extrapolating to full scale ship resistance

phases          (water air);

water
{
    transportModel  Newtonian;
    nu              1.09e-06; // kinematic viscosity [m^2/s]
    rho             998.8; // density [kg/m^3]
}

air
{
    transportModel  Newtonian;
    nu              1.48e-05;
    rho             1;
}

sigma           0;


// ************************************************************************* //
